Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: واضمم يدك إلى جناحك تخرج بيضاء من غير سوء آية أخرى
en: And draw in your hand to your side; it will come out white without disease - another sign,

source: لنريك من آياتنا الكبرى
en: That We may show you [some] of Our greater signs.

source: اذهب إلى فرعون إنه طغى
en: Go to Pharaoh. Indeed, he has transgressed."

source: قال رب اشرح لي صدري
en: [Moses] said, "My Lord, expand for me my breast [with assurance]

source: ويسر لي أمري
en: And ease for me my task

source: واحلل عقدة من لساني
en: And untie the knot from my tongue

source: يفقهوا قولي
en: That they may understand my speech.

source: واجعل لي وزيرا من أهلي
en: And appoint for me a minister from my family -

source: هارون أخي
en: Aaron, my brother.

source: اشدد به أزري
en: Increase through him my strength

source: وأشركه في أمري
en: And let him share my task

source: كي نسبحك كثيرا
en: That we may exalt You much

source: ونذكرك كثيرا
en: And remember You much.

source: إنك كنت بنا بصيرا
en: Indeed, You are of us ever Seeing."

source: قال قد أوتيت سؤلك يا موسى
en: [Allah] said, "You have been granted your request, O Moses.

source: ولقد مننا عليك مرة أخرى
en: And We had already conferred favor upon you another time,

source: إذ أوحينا إلى أمك ما يوحى
en: When We inspired to your mother what We inspired,

source: أن اقذفيه في التابوت فاقذفيه في اليم فليلقه اليم بالساحل يأخذه عدو لي وعدو له وألقيت عليك محبة مني ولتصنع على عيني
en: [Saying], 'Cast him into the chest and cast it into the river, and the river will throw it onto the bank; there will take him an enemy to Me and an enemy to him.' And I bestowed upon you love from Me that you would be brought up under My eye.

source: إذ تمشي أختك فتقول هل أدلكم على من يكفله فرجعناك إلى أمك كي تقر عينها ولا تحزن وقتلت نفسا فنجيناك من الغم وفتناك فتونا فلبثت سنين في أهل مدين ثم جئت على قدر يا موسى
en: [And We favored you] when your sister went and said, 'Shall I direct you to someone who will be responsible for him?' So We restored you to your mother that she might be content and not grieve. And you killed someone, but We saved you from retaliation and tried you with a [severe] trial. And you remained [some] years among the people of Madyan. Then you came [here] at the decreed time, O Moses.

source: واصطنعتك لنفسي
en: And I produced you for Myself.

source: اذهب أنت وأخوك بآياتي ولا تنيا في ذكري
en: Go, you and your brother, with My signs and do not slacken in My remembrance.

source: اذهبا إلى فرعون إنه طغى
en: Go, both of you, to Pharaoh. Indeed, he has transgressed.

source: فقولا له قولا لينا لعله يتذكر أو يخشى
en: And speak to him with gentle speech that perhaps he may be reminded or fear [Allah]."

source: قالا ربنا إننا نخاف أن يفرط علينا أو أن يطغى
en: They said, "Our Lord, indeed we are afraid that he will hasten [punishment] against us or that he will transgress."

source: قال لا تخافا إنني معكما أسمع وأرى
en: [Allah] said, "Fear not. Indeed, I am with you both; I hear and I see.

source: فأتياه فقولا إنا رسولا ربك فأرسل معنا بني إسرائيل ولا تعذبهم قد جئناك بآية من ربك والسلام على من اتبع الهدى
en: So go to him and say, 'Indeed, we are messengers of your Lord, so send with us the Children of Israel and do not torment them. We have come to you with a sign from your Lord. And peace will be upon he who follows the guidance.

source: إنا قد أوحي إلينا أن العذاب على من كذب وتولى
en: Indeed, it has been revealed to us that the punishment will be upon whoever denies and turns away.' "

source: قال فمن ربكما يا موسى
en: [Pharaoh] said, "So who is the Lord of you two, O Moses?"

source: قال ربنا الذي أعطى كل شيء خلقه ثم هدى
en: He said, "Our Lord is He who gave each thing its form and then guided [it]."

source: قال فما بال القرون الأولى
en: [Pharaoh] said, "Then what is the case of the former generations?"

source: قال علمها عند ربي في كتاب لا يضل ربي ولا ينسى
en: [Moses] said, "The knowledge thereof is with my Lord in a record. My Lord neither errs nor forgets."

source: الذي جعل لكم الأرض مهدا وسلك لكم فيها سبلا وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى
en: [It is He] who has made for you the earth as a bed [spread out] and inserted therein for you roadways and sent down from the sky, rain and produced thereby categories of various plants.

source: كلوا وارعوا أنعامكم إن في ذلك لآيات لأولي النهى
en: Eat [therefrom] and pasture your livestock. Indeed, in that are signs for those of intelligence.

source: منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى
en: From the earth We created you, and into it We will return you, and from it We will extract you another time.

source: ولقد أريناه آياتنا كلها فكذب وأبى
en: And We certainly showed Pharaoh Our signs - all of them - but he denied and refused.

source: قال أجئتنا لتخرجنا من أرضنا بسحرك يا موسى
en: He said, "Have you come to us to drive us out of our land with your magic, O Moses?

source: فلنأتينك بسحر مثله فاجعل بيننا وبينك موعدا لا نخلفه نحن ولا أنت مكانا سوى
en: Then we will surely bring you magic like it, so make between us and you an appointment, which we will not fail to keep and neither will you, in a place assigned."

source: قال موعدكم يوم الزينة وأن يحشر الناس ضحى
en: [Moses] said, "Your appointment is on the day of the festival when the people assemble at mid-morning."

source: فتولى فرعون فجمع كيده ثم أتى
en: So Pharaoh went away, put together his plan, and then came [to Moses].

source: قال لهم موسى ويلكم لا تفتروا على الله كذبا فيسحتكم بعذاب وقد خاب من افترى
en: Moses said to the magicians summoned by Pharaoh, "Woe to you! Do not invent a lie against Allah or He will exterminate you with a punishment; and he has failed who invents [such falsehood]."

source: فتنازعوا أمرهم بينهم وأسروا النجوى
en: So they disputed over their affair among themselves and concealed their private conversation.

source: قالوا إن هذان لساحران يريدان أن يخرجاكم من أرضكم بسحرهما ويذهبا بطريقتكم المثلى
en: They said, "Indeed, these are two magicians who want to drive you out of your land with their magic and do away with your most exemplary way.

source: فأجمعوا كيدكم ثم ائتوا صفا وقد أفلح اليوم من استعلى
en: So resolve upon your plan and then come [forward] in line. And he has succeeded today who overcomes."

source: قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى
en: They said, "O Moses, either you throw or we will be the first to throw."

source: قال بل ألقوا فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى
en: He said, "Rather, you throw." And suddenly their ropes and staffs seemed to him from their magic that they were moving [like snakes].

source: فأوجس في نفسه خيفة موسى
en: And he sensed within himself apprehension, did Moses.

source: قلنا لا تخف إنك أنت الأعلى
en: Allah said, "Fear not. Indeed, it is you who are superior.

source: وألق ما في يمينك تلقف ما صنعوا إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى
en: And throw what is in your right hand; it will swallow up what they have crafted. What they have crafted is but the trick of a magician, and the magician will not succeed wherever he is."

source: فألقي السحرة سجدا قالوا آمنا برب هارون وموسى
en: So the magicians fell down in prostration. They said, "We have believed in the Lord of Aaron and Moses."

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم في جذوع النخل ولتعلمن أينا أشد عذابا وأبقى
en: [Pharaoh] said, "You believed him before I gave you permission. Indeed, he is your leader who has taught you magic. So I will surely cut off your hands and your feet on opposite sides, and I will crucify you on the trunks of palm trees, and you will surely know which of us is more severe in [giving] punishment and more enduring."

source: قالوا لن نؤثرك على ما جاءنا من البينات والذي فطرنا فاقض ما أنت قاض إنما تقضي هذه الحياة الدنيا
en: They said, "Never will we prefer you over what has come to us of clear proofs and [over] He who created us. So decree whatever you are to decree. You can only decree for this worldly life.

source: إنا آمنا بربنا ليغفر لنا خطايانا وما أكرهتنا عليه من السحر والله خير وأبقى
en: Indeed, we have believed in our Lord that He may forgive us our sins and what you compelled us [to do] of magic. And Allah is better and more enduring."

source: إنه من يأت ربه مجرما فإن له جهنم لا يموت فيها ولا يحيى
en: Indeed, whoever comes to his Lord as a criminal - indeed, for him is Hell; he will neither die therein nor live.

source: ومن يأته مؤمنا قد عمل الصالحات فأولئك لهم الدرجات العلى
en: But whoever comes to Him as a believer having done righteous deeds - for those will be the highest degrees [in position]:

source: جنات عدن تجري من تحتها الأنهار خالدين فيها وذلك جزاء من تزكى
en: Gardens of perpetual residence beneath which rivers flow, wherein they abide eternally. And that is the reward of one who purifies himself.

source: ولقد أوحينا إلى موسى أن أسر بعبادي فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى
en: And We had inspired to Moses, "Travel by night with My servants and strike for them a dry path through the sea; you will not fear being overtaken [by Pharaoh] nor be afraid [of drowning]."

source: فأتبعهم فرعون بجنوده فغشيهم من اليم ما غشيهم
en: So Pharaoh pursued them with his soldiers, and there covered them from the sea that which covered them,

source: وأضل فرعون قومه وما هدى
en: And Pharaoh led his people astray and did not guide [them].

source: يا بني إسرائيل قد أنجيناكم من عدوكم وواعدناكم جانب الطور الأيمن ونزلنا عليكم المن والسلوى
en: O Children of Israel, We delivered you from your enemy, and We made an appointment with you at the right side of the mount, and We sent down to you manna and quails,

source: كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحل عليكم غضبي ومن يحلل عليه غضبي فقد هوى
en: [Saying], "Eat from the good things with which We have provided you and do not transgress [or oppress others] therein, lest My anger should descend upon you. And he upon whom My anger descends has certainly fallen."

source: وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى
en: But indeed, I am the Perpetual Forgiver of whoever repents and believes and does righteousness and then continues in guidance.

source: وما أعجلك عن قومك يا موسى
en: [Allah] said, "And what made you hasten from your people, O Moses?"

source: قال هم أولاء على أثري وعجلت إليك رب لترضى
en: He said, "They are close upon my tracks, and I hastened to You, my Lord, that You be pleased."

source: قال فإنا قد فتنا قومك من بعدك وأضلهم السامري
en: [Allah] said, "But indeed, We have tried your people after you [departed], and the Samiri has led them astray."

source: فرجع موسى إلى قومه غضبان أسفا قال يا قوم ألم يعدكم ربكم وعدا حسنا أفطال عليكم العهد أم أردتم أن يحل عليكم غضب من ربكم فأخلفتم موعدي
en: So Moses returned to his people, angry and grieved. He said, "O my people, did your Lord not make you a good promise? Then, was the time [of its fulfillment] too long for you, or did you wish that wrath from your Lord descend upon you, so you broke your promise [of obedience] to me?"

source: قالوا ما أخلفنا موعدك بملكنا ولكنا حملنا أوزارا من زينة القوم فقذفناها فكذلك ألقى السامري
en: They said, "We did not break our promise to you by our will, but we were made to carry burdens from the ornaments of the people [of Pharaoh], so we threw them [into the fire], and thus did the Samiri throw."

source: فأخرج لهم عجلا جسدا له خوار فقالوا هذا إلهكم وإله موسى فنسي
en: And he extracted for them [the statue of] a calf which had a lowing sound, and they said, "This is your god and the god of Moses, but he forgot."

source: أفلا يرون ألا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا
en: Did they not see that it could not return to them any speech and that it did not possess for them any harm or benefit?

source: ولقد قال لهم هارون من قبل يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري
en: And Aaron had already told them before [the return of Moses], "O my people, you are only being tested by it, and indeed, your Lord is the Most Merciful, so follow me and obey my order."

source: قالوا لن نبرح عليه عاكفين حتى يرجع إلينا موسى
en: They said, "We will never cease being devoted to the calf until Moses returns to us."

source: قال يا هارون ما منعك إذ رأيتهم ضلوا
en: [Moses] said, "O Aaron, what prevented you, when you saw them going astray,

source: ألا تتبعن أفعصيت أمري
en: From following me? Then have you disobeyed my order?"

source: قال يا ابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي
en: [Aaron] said, "O son of my mother, do not seize [me] by my beard or by my head. Indeed, I feared that you would say, 'You caused division among the Children of Israel, and you did not observe [or await] my word.' "

source: قال فما خطبك يا سامري
en: [Moses] said, "And what is your case, O Samiri?"

source: قال بصرت بما لم يبصروا به فقبضت قبضة من أثر الرسول فنبذتها وكذلك سولت لي نفسي
en: He said, "I saw what they did not see, so I took a handful [of dust] from the track of the messenger and threw it, and thus did my soul entice me."

source: قال فاذهب فإن لك في الحياة أن تقول لا مساس وإن لك موعدا لن تخلفه وانظر إلى إلهك الذي ظلت عليه عاكفا لنحرقنه ثم لننسفنه في اليم نسفا
en: [Moses] said, "Then go. And indeed, it is [decreed] for you in [this] life to say, 'No contact.' And indeed, you have an appointment [in the Hereafter] you will not fail to keep. And look at your 'god' to which you remained devoted. We will surely burn it and blow it into the sea with a blast.

source: إنما إلهكم الله الذي لا إله إلا هو وسع كل شيء علما
en: Your god is only Allah, except for whom there is no deity. He has encompassed all things in knowledge."

source: كذلك نقص عليك من أنباء ما قد سبق وقد آتيناك من لدنا ذكرا
en: Thus, [O Muhammad], We relate to you from the news of what has preceded. And We have certainly given you from Us the Qur'an.

source: من أعرض عنه فإنه يحمل يوم القيامة وزرا
en: Whoever turns away from it - then indeed, he will bear on the Day of Resurrection a burden,

source: خالدين فيه وساء لهم يوم القيامة حملا
en: [Abiding] eternally therein, and evil it is for them on the Day of Resurrection as a load -

source: يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا
en: The Day the Horn will be blown. And We will gather the criminals, that Day, blue-eyed.

source: يتخافتون بينهم إن لبثتم إلا عشرا
en: They will murmur among themselves, "You remained not but ten [days in the world]."

source: نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما
en: We are most knowing of what they say when the best of them in manner will say, "You remained not but one day."

source: ويسألونك عن الجبال فقل ينسفها ربي نسفا
en: And they ask you about the mountains, so say, "My Lord will blow them away with a blast.

source: فيذرها قاعا صفصفا
en: And He will leave the earth a level plain;

source: لا ترى فيها عوجا ولا أمتا
en: You will not see therein a depression or an elevation."

source: يومئذ يتبعون الداعي لا عوج له وخشعت الأصوات للرحمن فلا تسمع إلا همسا
en: That Day, everyone will follow [the call of] the Caller [with] no deviation therefrom, and [all] voices will be stilled before the Most Merciful, so you will not hear except a whisper [of footsteps].

source: يومئذ لا تنفع الشفاعة إلا من أذن له الرحمن ورضي له قولا
en: That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word.

source: يعلم ما بين أيديهم وما خلفهم ولا يحيطون به علما
en: Allah knows what is [presently] before them and what will be after them, but they do not encompass it in knowledge.

source: وعنت الوجوه للحي القيوم وقد خاب من حمل ظلما
en: And [all] faces will be humbled before the Ever-Living, the Sustainer of existence. And he will have failed who carries injustice.

source: ومن يعمل من الصالحات وهو مؤمن فلا يخاف ظلما ولا هضما
en: But he who does of righteous deeds while he is a believer - he will neither fear injustice nor deprivation.

source: وكذلك أنزلناه قرآنا عربيا وصرفنا فيه من الوعيد لعلهم يتقون أو يحدث لهم ذكرا
en: And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance.

source: فتعالى الله الملك الحق ولا تعجل بالقرآن من قبل أن يقضى إليك وحيه وقل رب زدني علما
en: So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, "My Lord, increase me in knowledge."

source: ولقد عهدنا إلى آدم من قبل فنسي ولم نجد له عزما
en: And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى
en: And [mention] when We said to the angels, "Prostrate to Adam," and they prostrated, except Iblees; he refused.

source: فقلنا يا آدم إن هذا عدو لك ولزوجك فلا يخرجنكما من الجنة فتشقى
en: So We said, "O Adam, indeed this is an enemy to you and to your wife. Then let him not remove you from Paradise so you would suffer.

source: إن لك ألا تجوع فيها ولا تعرى
en: Indeed, it is [promised] for you not to be hungry therein or be unclothed.

source: وأنك لا تظمأ فيها ولا تضحى
en: And indeed, you will not be thirsty therein or be hot from the sun."

source: فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى
en: Then Satan whispered to him; he said, "O Adam, shall I direct you to the tree of eternity and possession that will not deteriorate?"

source: فأكلا منها فبدت لهما سوآتهما وطفقا يخصفان عليهما من ورق الجنة وعصى آدم ربه فغوى
en: And Adam and his wife ate of it, and their private parts became apparent to them, and they began to fasten over themselves from the leaves of Paradise. And Adam disobeyed his Lord and erred.

source: ثم اجتباه ربه فتاب عليه وهدى
en: Then his Lord chose him and turned to him in forgiveness and guided [him].

source: قال اهبطا منها جميعا بعضكم لبعض عدو فإما يأتينكم مني هدى فمن اتبع هداي فلا يضل ولا يشقى
en: [Allah] said, "Descend from Paradise - all, [your descendants] being enemies to one another. And if there should come to you guidance from Me - then whoever follows My guidance will neither go astray [in the world] nor suffer [in the Hereafter].

source: ومن أعرض عن ذكري فإن له معيشة ضنكا ونحشره يوم القيامة أعمى
en: And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind."

source: قال رب لم حشرتني أعمى وقد كنت بصيرا
en: He will say, "My Lord, why have you raised me blind while I was [once] seeing?"

source: قال كذلك أتتك آياتنا فنسيتها وكذلك اليوم تنسى
en: [Allah] will say, "Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten."

source: وكذلك نجزي من أسرف ولم يؤمن بآيات ربه ولعذاب الآخرة أشد وأبقى
en: And thus do We recompense he who transgressed and did not believe in the signs of his Lord. And the punishment of the Hereafter is more severe and more enduring.

source: أفلم يهد لهم كم أهلكنا قبلهم من القرون يمشون في مساكنهم إن في ذلك لآيات لأولي النهى
en: Then, has it not become clear to them how many generations We destroyed before them as they walk among their dwellings? Indeed in that are signs for those of intelligence.

source: ولولا كلمة سبقت من ربك لكان لزاما وأجل مسمى
en: And if not for a word that preceded from your Lord, punishment would have been an obligation [due immediately], and [if not for] a specified term [decreed].

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها ومن آناء الليل فسبح وأطراف النهار لعلك ترضى
en: So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting; and during periods of the night [exalt Him] and at the ends of the day, that you may be satisfied.

source: ولا تمدن عينيك إلى ما متعنا به أزواجا منهم زهرة الحياة الدنيا لنفتنهم فيه ورزق ربك خير وأبقى
en: And do not extend your eyes toward that by which We have given enjoyment to [some] categories of them, [its being but] the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring.

source: وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك والعاقبة للتقوى
en: And enjoin prayer upon your family [and people] and be steadfast therein. We ask you not for provision; We provide for you, and the [best] outcome is for [those of] righteousness.

source: وقالوا لولا يأتينا بآية من ربه أولم تأتهم بينة ما في الصحف الأولى
en: And they say, "Why does he not bring us a sign from his Lord?" Has there not come to them evidence of what was in the former scriptures?

source: ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا أرسلت إلينا رسولا فنتبع آياتك من قبل أن نذل ونخزى
en: And if We had destroyed them with a punishment before him, they would have said, "Our Lord, why did You not send to us a messenger so we could have followed Your verses before we were humiliated and disgraced?"

source: قل كل متربص فتربصوا فستعلمون من أصحاب الصراط السوي ومن اهتدى
en: Say, "Each [of us] is waiting; so wait. For you will know who are the companions of the sound path and who is guided."

source: اقترب للناس حسابهم وهم في غفلة معرضون
en: [The time of] their account has approached for the people, while they are in heedlessness turning away.

source: ما يأتيهم من ذكر من ربهم محدث إلا استمعوه وهم يلعبون
en: No mention comes to them anew from their Lord except that they listen to it while they are at play

source: لاهية قلوبهم وأسروا النجوى الذين ظلموا هل هذا إلا بشر مثلكم أفتأتون السحر وأنتم تبصرون
en: With their hearts distracted. And those who do wrong conceal their private conversation, [saying], "Is this [Prophet] except a human being like you? So would you approach magic while you are aware [of it]?"

source: قال ربي يعلم القول في السماء والأرض وهو السميع العليم
en: The Prophet said, "My Lord knows whatever is said throughout the heaven and earth, and He is the Hearing, the Knowing."

source: بل قالوا أضغاث أحلام بل افتراه بل هو شاعر فليأتنا بآية كما أرسل الأولون
en: But they say, "[The revelation is but] a mixture of false dreams; rather, he has invented it; rather, he is a poet. So let him bring us a sign just as the previous [messengers] were sent [with miracles]."

source: ما آمنت قبلهم من قرية أهلكناها أفهم يؤمنون
en: Not a [single] city which We destroyed believed before them, so will they believe?

source: وما أرسلنا قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not before you, [O Muhammad], except men to whom We revealed [the message], so ask the people of the message if you do not know.

source: وما جعلناهم جسدا لا يأكلون الطعام وما كانوا خالدين
en: And We did not make the prophets forms not eating food, nor were they immortal [on earth].

source: ثم صدقناهم الوعد فأنجيناهم ومن نشاء وأهلكنا المسرفين
en: Then We fulfilled for them the promise, and We saved them and whom We willed and destroyed the transgressors.

source: لقد أنزلنا إليكم كتابا فيه ذكركم أفلا تعقلون
en: We have certainly sent down to you a Book in which is your mention. Then will you not reason?

source: وكم قصمنا من قرية كانت ظالمة وأنشأنا بعدها قوما آخرين
en: And how many a city which was unjust have We shattered and produced after it another people.

source: فلما أحسوا بأسنا إذا هم منها يركضون
en: And when its inhabitants perceived Our punishment, at once they fled from it.

source: لا تركضوا وارجعوا إلى ما أترفتم فيه ومساكنكم لعلكم تسألون
en: [Some angels said], "Do not flee but return to where you were given luxury and to your homes - perhaps you will be questioned."

source: قالوا يا ويلنا إنا كنا ظالمين
en: They said, "O woe to us! Indeed, we were wrongdoers."

source: فما زالت تلك دعواهم حتى جعلناهم حصيدا خامدين
en: And that declaration of theirs did not cease until We made them [as] a harvest [mowed down], extinguished [like a fire].
